cables = {'АС 120/19': {'d': 15.2, 'S': 136.8, 'Sa/Sc': '6.11-6.28', 'E': 8.25 * 10 ** 4, 'alfa': 19.2 * 10 ** (-6),
                        'sigma_vr': 290, 'sigma_nb': 120, 'sigma_sr': 90, 'P_l': 471, 'gamma_1': 3.38 * 10 ** (-2)} \
          }

# cables = {'АС 120/19':{'d':30, 'S':136.8, 'Sa/Sc':'6.11-6.28', 'E':8.25*10**4, 'alfa':19.2*10**(-6), 'sigma_vr':290,\
#                        'sigma_nb':120, 'sigma_sr':90, 'P_l':471, 'gamma_1':3.38*10**(-2)}\
#           }


"""
Діаметр провода не може бути більше 70 мм а також не може бути менше 5 мм, хоча якщо менше 5 мм, то розрахунок  буде
виконано, але, ймовірно, результат буде не вірний!!!
"""
