#інтерполяція для визначення коефіцієнта k1 для визначення лінійного експлуатаційного навантаження від ваги ожеледі Gmp
#значення h від 0 до 100
h = 85
def interpol_k1():
    h_k1 = {0:0, 5:0.7, 10:1, 20:1.3, 30:1.7, 50:2.2, 70:2.7, 100:3.3}
    if h in h_k1:
        return h_k1[h]
    elif 0 < h < 5:
        h0 = 0
        k1_0 = h_k1[h0]
        h1 = 5
        k1_1 = h_k1[h1]
    elif 5 < h < 10:
        h0 = 5
        k1_0 = h_k1[h0]
        h1 = 10
        k1_1 = h_k1[h1]
    elif  10 < h < 20:
        h0 = 10
        k1_0 = h_k1[h0]
        h1 = 20
        k1_1 = h_k1[h1]
    elif 20 < h < 30:
        h0 = 20
        k1_0 = h_k1[h0]
        h1 = 30
        k1_1 = h_k1[h1]
    elif 30 < h < 50:
        h0 = 30
        k1_0 = h_k1[h0]
        h1 = 50
        k1_1 = h_k1[h1]
    elif 50 < h < 70:
        h0 = 50
        k1_0 = h_k1[h0]
        h1 = 70
        k1_1 = h_k1[h1]
    elif 70 < h < 100:
        h0 = 70
        k1_0 = h_k1[h0]
        h1 = 100
        k1_1 = h_k1[h1]
    return k1_0 + (k1_1 - k1_0)/(h1 - h0)*(h - h0)




print(interpol_k1())
